app/views/team_members/edit.html.erb

SELECT "positions".* FROM "positions"
SELECT "positions".* FROM "positions" INNER JOIN "player_positions" ON "positions"."id" = "player_positions"."position_id" WHERE "player_positions"."team_member_id" = ?  [["team_member_id", 1]]
SELECT 1 AS one FROM "positions" INNER JOIN "player_positions" ON "positions"."id" = "player_positions"."position_id" WHERE "player_positions"."team_member_id" = ? AND "positions"."id" = 1 LIMIT 1  [["team_member_id", 1]]
---
<%= form_for @team_member do -%>
  <% Position.all.each do |position| -%>
    <div>
      <%= check_box_tag :position_ids, position.id, @team_member.positions.include?(position), :name => 'team_member[position_ids][]' -%>