app/views/users/index.html.erb

SELECT "team_members".* FROM "team_members" WHERE "team_members"."user_id" = ?  [["user_id", 1]]
---
              <tbody>
                 <% user.team_members.each do |team_member| %>

SELECT "positions".* FROM "positions" INNER JOIN "player_positions" ON "positions"."id" = "player_positions"."position_id" WHERE "player_positions"."team_member_id" = ?  [["team_member_id", 1]]
---
                  <td><%= team_member.team.name %></td>
                   <td> <% team_member.positions.each do |position| %>