app/controllers/team_members_controller.rb

  def index
    @team_members = TeamMember.all
---
SELECT "team_members".* FROM "team_members"

  def edit
    @team_member = TeamMember.find(params[:id])
---
SELECT "team_members".* FROM "team_members" WHERE "team_members"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @team_member.destroy
---
DELETE FROM "team_members" WHERE "team_members"."id" = ?  [["id", 1]]

    def set_team_member
      @team_member = TeamMember.find(params[:id])
---
SELECT "team_members".* FROM "team_members" WHERE "team_members"."id" = ? LIMIT 1  [["id", "1"]]