app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    if signed_in?
      @teams = current_user.teams
    else
      @teams = Team.all