app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "last_name" = ?, "email" = ?, "password" = ?, "phone_number" = ?, "street_address" = ?, "city" = ?, "state" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["last_name", "Doe"], ["email", ""], ["password", ""], ["phone_number", ""], ["street_address", ""], ["city", ""], ["state", ""], ["updated_at", Mon, 03 Nov 2014 22:33:33 UTC +00:00]]